posts/cmu15-721-lecture-note/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>cmu15-721 lecture note | Abner Zheng's Blog</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://abnerzheng.github.io/posts/cmu15-721-lecture-note/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Abner Zheng">
<link rel="prev" href="../dnsxue-xi/" title="DNS学习" type="text/html">
<link rel="next" href="../b-tree-suo-ji-zhu-yan-jiu/" title="B-tree 锁技术研究(翻译)" type="text/html">
<meta property="og:site_name" content="Abner Zheng's Blog">
<meta property="og:title" content="cmu15-721 lecture note">
<meta property="og:url" content="https://abnerzheng.github.io/posts/cmu15-721-lecture-note/">
<meta property="og:description" content="*



lecture2 内存数据库介绍


内存数据库和磁盘数据库的区别


DDBMS(Disk-oriented Database Management System)的很多设计是建立在磁盘模型上的，很多设计都是为了避免磁盘缺陷而设计的。但如今，硬件的改变使得大多数的数据库都能够存放在内存中，在这样的背景下，DDBMS的某些设计就不再是最优的。




Buffer Pool


因为DD">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-12-25T10:09:43+08:00">
</head>
<body class="theme-base-08">
    <a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">文章存档</a>
        <a class="sidebar-nav-item" href="../../categories/">标签</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS 源</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://abnerzheng.github.io/" title="Abner Zheng's Blog" rel="home">Abner Zheng's Blog</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">cmu15-721 lecture note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Abner Zheng</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-12-25T10:09:43+08:00" itemprop="datePublished" title="2017-12-25 10:09">2017-12-25 10:09</time></a></p>
                <p class="commentline">
        


        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
*
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">lecture2 内存数据库介绍</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">内存数据库和磁盘数据库的区别</h3>
<div class="outline-text-3" id="text-1-1">
<p>
DDBMS(Disk-oriented Database Management System)的很多设计是建立在磁盘模型上的，很多设计都是为了避免磁盘缺陷而设计的。但如今，硬件的改变使得大多数的数据库都能够存放在内存中，在这样的背景下，DDBMS的某些设计就不再是最优的。
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Buffer Pool</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
因为DDBMS的数据都存放在硬盘或ssd中，磁盘读的速率比内存的速率低3个数量级， 因此需要使用缓存池来缓存磁盘页。
</p>
</div>

<ul class="org-ul"><li>
<a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>缓存池的基本算法<br><div class="outline-text-5" id="text-1-1-1-1">
<p>
GetPage(pageid):
</p>
<ul class="org-ul">
<li>如果不在缓存池中，从磁盘中使用pageId读取该页p，如果缓存池中有空余空间，则直接添加到缓存池中。
</li>
<li>如果没有空余空间，则按选举算法选举出某一页, 如果该页dirty位为假,直接移除该页，存放页p。
</li>
<li>如果该页dirty位为真, 在移除前将内容写入磁盘,其他操作如上。
</li>
</ul>
<p>
如果所有的数据都在内存中的时候，就不必再使用buffer poll。
</p>


<p>
内存数据库的概念在19世纪80年代就提出来了，但是近期才由于硬件的发展而开始可行。
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">不要使用MMAP</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
因为一个好的数据库必须要自己掌控文件读写的时间点。OS不知道数据库中的知识，无法优化。
</p>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../dnsxue-xi/" rel="prev" title="DNS学习">前一篇</a>
            </li>
            <li class="next">
                <a href="../b-tree-suo-ji-zhu-yan-jiu/" rel="next" title="B-tree 锁技术研究(翻译)">后一篇</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>注释</h2>
        
        


        </section></article><footer id="footer"><p>Contents © 2018         <a href="mailto:abnerzheng@gmail.com">Abner Zheng</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
